<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {
	color: #000000;
	font-weight: bold;
}
.Estilo2 {color: #000000}
-->
</style>
</head>

<body>
<h2 align="center" class="Estilo1">ACCESO AL BIOS PARA CONFIGURAR DISPOSITIVOS Y SECUENCIAS DE ARRANQUE </h2>
<p align="left" class="Estilo1">&nbsp;</p>
<p>La&nbsp;BIOS&nbsp;posee  una interfaz que permite modificar la configuraci&oacute;n de la placa madre:  el&nbsp;Setup. Se trata de un peque&ntilde;o programa que se encarga de gestionar los  diferentes componentes de la computadora. <br />
  El prop&oacute;sito fundamental del BIOS es iniciar y probar el<strong>&nbsp;</strong>Hardware del sistema y cargar un gestor de aranque o un sistema operativo desde un dispositivo de almacenamiento de datos<strong>. </strong>Adem&aacute;s,  el BIOS provee una capa de abstracci&oacute;n para el&nbsp;hardware, por ejemplo, que consiste en una v&iacute;a para que los programas  de aplicaciones y los sistemas operativos interact&uacute;en con el teclado y monitor. La  configuraci&oacute;n de BIOS tiene procedimientos y pasos los cuales son muy  importantes ya que nos ayudara a saber si obtuvo m&aacute;s cambios y en cuanto  tiempo. </p>
<p>&nbsp;</p>
<h2>&nbsp;</h2>
<h2>Pr&aacute;ctica </h2>
<h2>Pasos para la  configuraci&oacute;n del bios de la maquina con procesador Intel. D Lenovo TM ideapad TM  110</h2>
<p>&nbsp;</p>
<h1><strong>1. Apaga y enciende</strong></h1>
<p><img width="522" height="314" src="Acceso_clip_image001_0000.jpg" align="left" hspace="12" alt="Apagarz" /><strong> </strong></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>Para  poder entrar en la BIOS lo primero que necesitas es llegar al inicio del  arranque del PC. La forma m&aacute;s r&aacute;pida de hacer esto es <strong>apagarlo por completo</strong>,  pues as&iacute; la pr&oacute;xima vez que se encienda tendr&aacute;s la opci&oacute;n de entrar en la BIOS  pulsando la tecla correspondiente. Para apagar tu PC, pulsa Alt+F4 en el  Escritorio o usa el Men&uacute; Inicio.</p>
<p><br />
  Lo  &uacute;nico que debes tener en cuenta es que necesitas <strong>apagarlo por completo</strong> y  no te valdr&aacute; con suspenderlo o entrar en hibernaci&oacute;n. De hecho, si tu port&aacute;til  tiene alg&uacute;n tipo de tecnolog&iacute;a de &quot;inicio r&aacute;pido&quot;, es posible que el  apagado normal tampoco te sirva. En tal caso, sigue leyendo.</p>
<h1><strong>... o reinicia</strong></h1>
<pre><img width="537" height="281" src="Acceso_clip_image001_0001.jpg" alt="Opciones" /> </pre>
<p>Si  est&aacute;s usando Windows y quieres entrar en la BIOS, deber&aacute;s reiniciarlo. Pero <strong>no  te vale con un reinicio normal</strong> en la mayor&iacute;a de los casos. Para llevar a  cabo un reinicio completo, deber&aacute;s llevar a cabo una serie de pasos. Primero,  haz clic en el men&uacute; inicio y luego elige <strong>Configuraci&oacute;n.</strong></p>
<p></p>
<p><img width="543" height="375" src="Acceso_clip_image002.jpg" alt="Ct" /> </p>
<p><br />
  Ya  dentro de la <em>Configuraci&oacute;n de Windows</em>, deber&aacute;s dirigirte al &uacute;ltimo  apartado llamado <strong>Actualizaci&oacute;n y seguridad</strong>. Es aqu&iacute; donde se engloban  configuraciones similares de recuperaci&oacute;n y soluci&oacute;n de problemas.</p>
<p></p>
<p><img width="697" height="485" src="Acceso_clip_image002_0000.jpg" alt="Reiniciarahora" /> </p>
<p><br />
  A  continuaci&oacute;n deber&aacute;s hacer clic en la pesta&ntilde;a <strong>Recuperaci&oacute;n</strong> (en el panel  de la izquierda) y despu&eacute;s hacer clic en el bot&oacute;n llamado <strong>Reiniciar ahora</strong>,  debajo del apartado <em>Inicio avanzado</em>. Como se explica en el texto, es un  tipo de reinicio especial, que muestra un men&uacute; como el que ver&aacute;s a  continuaci&oacute;n.</p>
<p></p>
<p><img width="697" height="377" src="Acceso_clip_image002_0001.jpg" alt="Solucionar" /> </p>
<p><br />
  Ver&aacute;s  entonces el men&uacute; con fondo azul del que te habl&aacute;bamos en nuestro art&iacute;culo sobre como entra entar en el modo seguro de windows 10. Es un men&uacute;  que m&aacute;s que nada se usa para resolver problemas con Windows, aunque una de las  opciones es precisamente para poder entrar en la BIOS. Haz clic en <strong>Solucionar  problemas.</strong></p>
<p></p>
<p><img width="697" height="377" src="Acceso_clip_image002_0002.jpg" alt="Avanzado" /> </p>
<p><br />
  A  continuaci&oacute;n, elige <strong>Opciones avanzadas</strong>. Esperemos que no necesites  entrar en la BIOS con mucha frecuencia pues, como ves, el camino consta de  muchos m&aacute;s pasos de los que nos gustar&iacute;a.</p>
<p></p>
<p><img width="697" height="377" src="Acceso_clip_image002_0003.jpg" alt="Configuefi" /> </p>
<p><br />
  Por  &uacute;ltimo, haz clic en <strong>Configuraci&oacute;n de firmware UEFI</strong>. El nombre en s&iacute; no  es demasiado intuitivo, pero b&aacute;sicamente quiere decir que reiniciar&aacute; el PC y te  dejar&aacute; entrar en la configuraci&oacute;n del firmware, que viene a ser lo mismo que la  BIOS.</p>
<p></p>
<h1><strong>2. Pulsa ESC o F1 en el teclado</strong></h1>
<h1><br />
  <img width="697" height="377" src="Acceso_clip_image002_0004.jpg" alt="Bios Setup" /> </h1>
<p><br />
  Tanto  si has apagado el PC y lo has vuelto a encender como si usaste el reinicio  avanzado, es posible que necesites <strong>pulsar cierta tecla de tu teclado</strong> en  un momento justo. La tecla puede variar de un PC a otro, aunque suele  especificarla durante un corto periodo de tiempo en la pantalla durante el  inicio.</p>
<p>La tecla puede ser <strong>F1, F2, F10, F11, F12, Esc</strong> o alguna  combinaci&oacute;n tipo Control + Alt + Escape, y lo m&aacute;s f&aacute;cil es que la pulses sin  parar durante el inicio, pues  si esperas al momento concreto quiz&aacute; se te pase. Si no sabes que tecla es y no  ves la indicaci&oacute;n en la pantalla, una b&uacute;squeda en Google de &quot;marca de tu  PC + entre BIOS&quot; deber&iacute;a darte la soluci&oacute;n. Tambi&eacute;n es posible que est&eacute; en  el manual del PC.</p>
<p><br />
  <img width="696" height="391" src="Acceso_clip_image002_0005.jpg" alt="Bios" /> </p>
<p><br />
  Si  todo va bien ver&aacute;s la pantalla de configuraci&oacute;n de la BIOS, que probablemente  sea parecida a la anterior. Y decimos probablemente porque realmente <strong>el  dise&ntilde;o y funciones dependen del fabricante del PC</strong> si han decidido crear un  dise&ntilde;o m&aacute;s elaborado o usar el viejo cl&aacute;sico como el que se ve en la pantalla  anterior. En el caso de ordenadores port&aacute;tiles, por ejemplo, las opciones  disponibles suelen ser mucho m&aacute;s reducidas</p>
<p>&nbsp;</p>
<h1>Lo que tiene que identificar la Bios al entrar </h1>
<ul>
  <li>Desde el disco  duro - &eacute;ste puede ser designado por:</li>
</ul>
<p>IDE<br />
  HD<br />
  Hard Disk<br />
  Hard Drive<br />
  Seg&uacute;n el modelo </p>
<ul>
  <li>Desde la  unidad de CD/DVD - &eacute;ste puede ser designado por:</li>
</ul>
<p>IDE<br />
  CD<br />
  DVD<br />
  CD Drive<br />
  DVD Drive</p>
<ul>
  <li>Desde un  lector de disquetes - &eacute;ste puede ser designado por:</li>
</ul>
<p>floppy disk<br />
  FD<br />
  Seg&uacute;n el modelo<br />
  Desde la red - &eacute;sta puede ser:<br />
  LAN<br />
  Network<br />
  Ethernet<br />
  Et</p>
<p><img src="PROYECTO NUEVO [Modo de compatibilidad] - Word 30_05_2019 16_05_03.png" alt="Cuadro" width="566" height="528" /></p>
<p><a href="tema 3.mp4" class="Estilo1">Video</a></p>
</body>
</html>
