<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {color: #000000}
-->
</style>
</head>

<body>
<h1 align="center">FUNCION DE LOS SITEMAS OPERATIVOS</h1>
<p>Las&nbsp;funciones<strong> </strong>de<strong> </strong>un<strong> </strong>sistema<strong> </strong>operativo&nbsp;m&aacute;s destacadas son  la gesti&oacute;n de procesos, de la memoria y la comunicaci&oacute;n entre aplicaciones,  entre otras.<br />
Un sistema operativo es el software principal o conjunto de programas  que gestionan todos los procesos que surgen dentro de un aparato electr&oacute;nico. <img width="148" height="99" src="Funcion.jpg" align="left" hspace="12" alt="Descripci&oacute;n: funciones del sistema operativo" /> </p>
<p>No son los programas y aplicaciones que usamos habitualmente para el  manejo por ejemplo del ordenador, sino las caracter&iacute;sticas que permiten que  esas aplicaciones funcionen. <br />
  Uno de los prop&oacute;sitos del sistema operativo es gestionar el n&uacute;cleo, los  recursos de localizaci&oacute;n y el&nbsp;<a href="https://www.lifeder.com/tipos-de-hardware/" target="_blank" class="Estilo1">Hardware</a>&nbsp;de nuestra  m&aacute;quina. La mayor&iacute;a de los aparatos electr&oacute;nicos en el mercado que cuentan con  un microprocesador, tienen un sistema operativo. <br />
  Al inicio de la creaci&oacute;n de sistemas  operativos, el mayor fallo que ten&iacute;an era que ten&iacute;an muy poca capacidad y muy  baja utilizaci&oacute;n, as&iacute; que normalmente se hac&iacute;a de forma manual a trav&eacute;s de un  batch. Dentro del batch los Jobs, que son las &oacute;rdenes que se necesitan para  realizar una acci&oacute;n, se activaban manualmente. <br />
  A medida que aumentaba la complejidad  de los sistemas operativos, se necesitaba automatizar esas tareas, apareciendo  as&iacute; los primeros int&eacute;rpretes de comandos. <br />
  Con todas las actualizaciones y  descubrimientos que se han hecho a lo largo de los a&ntilde;os, nada queda ya de los  primeros sistemas operativos que hab&iacute;a que activar manualmente. <br />
  Cada vez son m&aacute;s sofisticados y se  activan solos para proteger la m&aacute;quina y realizar tareas necesarias y  rutinarias. <br />
  Funciones de los sistemas operativos
  <br />
  Como comentamos antes, la mayor&iacute;a de  los sistemas operativos ya vienen prefabricados con una lista de tareas que  realizar dentro de nuestro aparato electr&oacute;nico para que todo vaya sobre ruedas. <br />
  S&oacute;lo es necesario realizar peque&ntilde;os  ajustes para adecuar la configuraci&oacute;n a las necesidades de nuestro aparato. <br />
  1-  Gesti&oacute;n de procesos <br />
  Una de las partes m&aacute;s importantes de un  sistema operativo es la gesti&oacute;n de los procesos. Los procesos son los recursos  que necesita un programa para ejecutarse. <br />
  Esto implica el uso de la memoria, del  tiempo del CPU (unidad central de procesamiento) y los archivos a los que  necesita acceso la aplicaci&oacute;n para funcionar bien. <br />
  El sistema operativo, para encargarse  del buen funcionamiento de la m&aacute;quina, se dedica a crear y destruir procesos,  pararlos y reanudarlos y ayudar con los mecanismos de comunicaci&oacute;n entre  procesos. <br />
  Podemos comparar esta tarea con el trabajo  de un oficinista. Si hacemos una lista de tareas, el sistema de gesti&oacute;n de  procesos establecer&aacute; una l&iacute;nea de acci&oacute;n donde coloque los procesos m&aacute;s  importantes en lugar prioritario, los intermedios en un lugar intermedio, y por  &uacute;ltimo los menos importantes en &uacute;ltimo lugar. <br />
  El problema de esto es que la gesti&oacute;n  de procesos se hace a trav&eacute;s de una m&aacute;quina que establece prioridades  arbitrarias a las tareas a realizar, y algunas veces tareas poco importantes  quedan sin ejecutar. <br />
  Es necesario entonces cambiar la  configuraci&oacute;n de la herramienta de gesti&oacute;n de procesos y dar mayor prioridad a  las tareas necesarias o forzar su ejecuci&oacute;n a mano. <br />
  <strong>2- Gesti&oacute;n de la memoria  principal</strong> <br />
  Otro de los componentes importantes del  sistema operativo es la gesti&oacute;n de la memoria principal. La memoria consiste en  un almac&eacute;n de datos que es compartido por la CPU y las aplicaciones y que  pierde su capacidad si surge alg&uacute;n fallo. <br />
  Por eso, es importante que el sistema  operativo se encargue de la gesti&oacute;n de la memoria, para que no se sature y se  pierdan datos e informaci&oacute;n ah&iacute; contenidos. <br />
  El sistema operativo se asegura de que  parte de la memoria est&aacute; siendo utilizada y por qu&eacute;. Decide d&oacute;nde se colocan  los procesos cuando haya un hueco libre y asigna y reclama el espacio que sea  necesario para que siempre est&eacute; bien aprovechada. <br />
  <strong>3- Gesti&oacute;n del almacenamiento  secundario</strong> <br />
  La memoria es algo muy vol&aacute;til y ante  cualquier fallo puede perder la informaci&oacute;n contenida en ella. Por esto, es  necesario tener un segundo m&oacute;dulo de almacenamiento que pueda almacenar los  datos a largo plazo. <br />
  Al igual que con la memoria principal,  el sistema operativo se encarga de gestionar el espacio libre y asigna el orden  de guardado. Tambi&eacute;n se asegura de que todo quede perfectamente guardado, as&iacute;  como de cu&aacute;nto espacio queda libre y d&oacute;nde. <br />
  <strong>4- Gesti&oacute;n del sistema de  entrada y salida</strong> <br />
  El sistema operativo es el encargado de  gestionar los puertos de entrada y salida del ordenador, como pueden ser unos  auriculares, una impresora, un monitor, etc. <br />
  Antiguamente, cuando quer&iacute;as instalar  un nuevo puerto externo, era importante tener un disco de instalaci&oacute;n que  contuviera los drivers para que el ordenador los aceptase. <br />
  Ahora, en nuestros d&iacute;as, el sistema  operativo del propio ordenador se suele encargar de buscar en la red la informaci&oacute;n  necesaria para que los nuevos puertos externos funcionen a la perfecci&oacute;n. <br />
  <strong>5- Registro del sistema de  archivos</strong> <br />
  Los archivos son formatos creados por  sus due&ntilde;os que se convierten en tablas, y el sistema operativo es el encargado  de registrarlas y guardarlas. <br />
  El sistema operativo se encarga de  construir, eliminar y archivar los archivos creados, as&iacute; como de ofrecer las  herramientas necesarias para poder acceder a los archivos en cualquier momento. <br />
  Establece la comunicaci&oacute;n entre los  archivos y las unidades de almacenamiento, y por &uacute;ltimo, se puede configurar de  manera que haga copias de seguridad de todos los archivos, para que en caso de  accidente, no se pierdan todos. <br />
  <strong>6- Seguridad</strong> <br />
  El sistema operativo es el encargado de  la seguridad de la m&aacute;quina. Una de las actividades m&aacute;s importantes es el acceso  de usuarios o programas a donde no deben. <br />
  Existen muchos virus que pueden afectar  a nuestro sistema, y el sistema operativo se encarga de que esto no suceda. <br />
  Se puede configurar el sistema  operativo de manera que se realicen controles peri&oacute;dicos y se establezcan los  controles de seguridad que tiene que realizar. <br />
  <strong>7-&nbsp;Comunicaci&oacute;n entre  elementos y aplicaciones</strong> <br />
  A trav&eacute;s de las interfaces de red, el  sistema operativo mantiene la comunicaci&oacute;n entre los distintos componentes de  la m&aacute;quina y todas las aplicaciones que est&eacute;n en contacto con ellos.&nbsp;Env&iacute;a  y recibe informaci&oacute;n. <br />
  <strong>8- Informar del estado del  sistema</strong> <br />
  Existen una serie de aplicaciones que  vienen instaladas por defecto junto al sistema operativo, pero que no son un  sistema como tal. <br />
  Estas ofrecen un entorno y unas  caracter&iacute;sticas b&aacute;sicas para el desarrollo y la ejecuci&oacute;n de los programas que  est&aacute;n instalados en nuestra m&aacute;quina. <br />
  Informa del estado del sistema, si se  necesita realizar alguna acci&oacute;n o aprobar que se realice alguna acci&oacute;n, como  pueden ser las actualizaciones autom&aacute;ticas. <br />
  Adem&aacute;s,  da soporte a los distintos lenguajes de programaci&oacute;n para que cualquier tipo de  aplicaci&oacute;n sea operativa en nuestra m&aacute;quina cuenta con programas que mejoran  la comunicaci&oacute;n entre las aplicaciones.<br />
  <strong>9-  Gesti&oacute;n de recursos</strong><br />
  Administra todas las partes  principales de la m&aacute;quina a trav&eacute;s de su gestor de recursos. Su funci&oacute;n como administrador conlleva  la seguridad y comunicaci&oacute;n de la unidad central de procesamiento, los dispositivos  externos que son conectados al ordenador. <br />
  Al igual que la memoria interna y la  memoria secundaria, donde a veces tiene que hacer limpieza y cambiar partes  almacenadas de una a otra.&nbsp; <br />
  En general, administra todos los  recursos del sistema y todos los recursos que entran en contacto con el mismo <br />
  <strong>10- Administraci&oacute;n de usuarios</strong> <br />
  El sistema operativo tambi&eacute;n es el  encargado de gestionar los perfiles almacenados en el ordenador dependiendo de  quien tenga creado un perfil en &eacute;l. <br />
  La administraci&oacute;n de usuarios puede ser  monousuario o multiusuario. Esto no significa que el sistema operativo permita  que s&oacute;lo se cree un perfil de usuario para utilizar en un ordenador. <br />
  Que sea un perfil de monousuario  implica que s&oacute;lo las ejecuciones de ese usuario est&eacute;n activas y solo las de &eacute;l.  En el otro, en el multiusuario, permite que las tareas de m&aacute;s de un usuario  est&eacute;n activas al mismo tiempo.</p>
<p>Los sistemas operativos m&aacute;s comunes <br />
  Los sistemas operativos m&aacute;s conocidos y  utilizados en el mercado son Windows, y Linux para ordenadores. Existen miles  de sistemas operativos, con mayor o menos grado de sofisticaci&oacute;n, dependiendo  para que aparato sean necesarios. <br />
  Windows pertenece al gran macro imperio  de Microsoft, mientras que iOS pertenece a Apple. Linux por su parte, es una plataforma  de software libre que permite modificar su sistema operativo. Dentro de la  plataforma Linux se encuentra Ubuntu y Devian, que son los m&aacute;s conocidos. <br />
  Estos softwares libres permiten al  usuario modificar el sistema operativo como &eacute;l guste. Tambi&eacute;n tiene un cierto  riesgo, y es que tocar el n&uacute;cleo del sistema operativo cuando no se tienen  muchos conocimientos puede generar una cat&aacute;strofe. <br />
Por el contrario, los sistemas operativos  como Windows he iOS, ya vienen preparados para los usuarios m&aacute;s inexpertos, de  manera que la configuraci&oacute;n inicial del sistema operativo permite su uso sin  tener que realizar ninguna modificaci&oacute;n costosa</p>
<p>El sistema operativo, para encargarse  del buen funcionamiento de la m&aacute;quina, se dedica a crear y destruir procesos,  pararlos y reanudarlos y ayudar con los mecanismos de comunicaci&oacute;n entre  procesos. <br />
  Podemos comparar esta tarea con el  trabajo de un oficinista. Si hacemos una lista de tareas, el sistema de gesti&oacute;n  de procesos establecer&aacute; una l&iacute;nea de acci&oacute;n donde coloque los procesos m&aacute;s  importantes en lugar prioritario, los intermedios en un lugar intermedio, </p>
<p>&nbsp;</p>
<p><img src="1 F.png" alt="ALL" width="759" height="458" hspace="12" align="middle" /></p>
<p>&nbsp;</p>
<p>En  probabilidad nos ayudara a saber y descubrir cada d&eacute;cada tuvo un cambio y una  transformaci&oacute;n de acuerdo a como fue evolucionando la manera de trabajar en sus  sistemas operativos. En esta grafica descubriremos las trasformaciones de una  m&aacute;quina y su evoluci&oacute;n de como a ido mejorando.</p>
<p>&nbsp;</p>
<p><img src="Funcion.png" alt="1" width="577" height="337" /></p>
<p><br />
La  evoluci&oacute;n tuvo varios cambios y varias formas de utilizarse una de las  principales evoluciones fue la de gestionar procesos que inicio y que llevo a  cabo la evoluci&oacute;n de varias funciones. En la gr&aacute;fica nos explica desde la  evoluci&oacute;n m&aacute;s baja a la evoluci&oacute;n m&aacute;s alta.</p>
<p><a href="tema 2.mp4" class="Estilo1">Video</a></p>
</body>
</html>
