<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {font-size: 24px}
.Estilo3 {
	font-size: 36px;
	color: #0000FF;
}
-->
</style>
</head>

<body>
<p class="Estilo1">Instalacion y Configuracion de drivers y software dependiendo del usuario</p>
<p align="justify">La&nbsp;instalaci&oacute;n&nbsp;de los programas computacionales (software)  es el proceso fundamental por el cual los nuevos programas son transferidos a  un computador con el fin de ser configurados, y preparados para ser desarrollados. Un  programa recorre diferentes&nbsp;fase de desarrollo durante  su vida &uacute;til:</p>
<p align="justify">&nbsp;</p>
<div align="justify">
  <ul>
    <li>Programador: esto te sirve mucho para poder  programar.</li>
    <li>Desarrollo: cada programador necesita el  programa instalado, pero con las herramientas, c&oacute;digos fuente, bancos de datos  y etc, para modificar el programa.</li>
    <li>Prueba: antes de la entrega al usuario,  el&nbsp;software&nbsp;debe ser sometido a pruebas. Esto se hace, en caso  de&nbsp;software&nbsp;complejos, en una instalaci&oacute;n ad hoc .</li>
    <li>Producci&oacute;n: Para ser utilizado por el usuario  final.</li>
  </ul>
</div>
<p align="justify">En cada una de esas fases la instalaci&oacute;n cumple  diferentes objetivos. En espa&ntilde;ol,&nbsp;programa&nbsp;sirve para se&ntilde;alar tanto  un guio &nbsp;o archivo ejecutable, ejemplo tal como un conjunto de archivos que sirven un fin com&uacute;n, ejemplo&nbsp;libre office  Por eso usaremos el  neologismo&nbsp;software&nbsp;para programas computacionales<br />
<u>Proceso de la instalaci&oacute;n:</u></p>
<div align="justify">
  <ul>
    <li>Verificaci&oacute;n  de la compatibilidad: Se debe comprobar si se cumplen los requisitos para la  instalaci&oacute;n en cuanto a hardware y software A veces es necesario desinstalar versiones antiguas del  mismo software.</li>
    <li>Verificaci&oacute;n  de la integridad: Se verifica que el paquete software <a href="https://es.wikipedia.org/wiki/Paquete_de_software" title="Paquete de software"></a>&nbsp;es el original, esto se hace para  evitar la instalaci&oacute;n de programas maliciosos.</li>
    <li>Creaci&oacute;n  de los directorios requeridos: Para mantener el orden en el directorio cada  sistema operativo puede tener un est&aacute;ndar para la instalaci&oacute;n de ciertos  archivos en ciertos directorios. Ver por ejemplo Linux Standard Base </li>
    <li>Creaci&oacute;n  de los usuarios requeridos: Para deslindar responsabilidades y tareas se pueden  o deben usar diferentes usuarios para diferentes paquetes de software.</li>
    <li>Concesi&oacute;n  de los derechos requeridos: Para ordenar el sistema y limitar da&ntilde;os en caso  necesario, se le conceden a los usuarios solo el m&iacute;nimo necesario de derechos.</li>
    <li>Copia, desempaque &nbsp;y descomprension &nbsp;de los archivos desde el paquete software : Para ahorrar ancho de la banda &nbsp;y tiempo en la transmisi&oacute;n por internet o espacio  de disco duro , los paquetes vienen empacados y comprimidos.</li>
    <li>Archivos  principales, sean de fuente o binarios.</li>
    <li>Archivos  de datos, por ejemplo datos, im&aacute;genes, modelos, documentos XML-Dokumente, etc.</li>
    <li>Documentacion</li>
    <li>Archivos de configuraci&oacute;n</li>
    <li>Bibliotecas</li>
    <li>Enlaces duros y enlaces simbolicos &nbsp;a otros archivos</li>
    <li>Compilaci&oacute;n y enlace con las bibliotecas  requeridas: En algunos casos no se puede evitar el complicado paso de la  compilaci&oacute;n y enlace que a su vez tiene severos requerimientos de software al  sistema. El enlace con bibliotecas requeridas puede ser un problema si en su  instalaci&oacute;n no se acataron los est&aacute;ndares establecidos.</li>
    <li>Configuraci&oacute;n: Por medio de archivos de  configuraci&oacute;n se le da a conocer al software con que par&aacute;metros debe trabajar.  Por ejemplo, los nombres de las personas que pueden usar el software, como  verificar su clave de ingreso, la ruta&nbsp;donde se encuentran los archivos con  datos o la direcci&oacute;n de nuestro proveedor de correo electronico <a href="https://es.wikipedia.org/wiki/Email" title="Email"></a>.  Para sistemas complejos se debe desarrollar el Software Configuracion Managment </li>
    <li>Definir las variables de estorno &nbsp;requeridas: Algunos comportamientos del  software solo pueden ser determinados por medio de estas variables. Esto es  parte de la configuraci&oacute;n, aunque es m&aacute;s din&aacute;mica.</li>
    <li>Registro ante el due&ntilde;o de la marca: Para  el Software comercial <a href="https://es.wikipedia.org/wiki/Software_comercial" title="Software comercial"> </a>&nbsp;a veces el desarrollador de software  exige el registro de la instalaci&oacute;n si se desea su servicio.</li>
  </ul>
</div>
<p align="justify"><u>T&eacute;rmino de la instalaci&oacute;n:</u></p>
<div align="justify">
  <ul>
    <li>Si un sistema de gestion de empaque realiza  paquetes de software del sistema.</li>
    <li>En caso de que bibliotecas <a href="https://es.wikipedia.org/wiki/Biblioteca_(programaci%C3%B3n)" title="Biblioteca (programaci&oacute;n)"></a>&nbsp;hayan  sido cambiadas por la instalaci&oacute;n, es necesario arrancar <a href="https://es.wikipedia.org/wiki/Arranque_(inform%C3%A1tica)" title="Arranque (inform&aacute;tica)"></a>&nbsp;el  sistema operativo o el software nuevamente para hacer efectivos los cambios en  todos los programas.</li>
  </ul>
  <br clear="all" />
</div>
<p align="justify"><u>&nbsp;</u><u>Configuraci&oacute;n de drivers y software:</u><u> </u><br />
  Es una  especializaci&oacute;n de la gestion de configuracion <a href="https://es.wikipedia.org/wiki/Gesti%C3%B3n_de_configuraci%C3%B3n" title="Gesti&oacute;n de configuraci&oacute;n"></a>&nbsp;a  todas las actividades en el sector del desarrollo de software .Esto trata y controla:</p>
<div align="justify">
  <ul>
    <li>La  elaboraci&oacute;n de codigo fuente &nbsp;por varios desarrolladores &nbsp;simult&aacute;neamente.</li>
    <li>El  seguimiento del estado de las fase de desarrollo de software <a href="https://es.wikipedia.org/wiki/Fases_del_desarrollo_de_software" title="Fases del desarrollo de software"></a>&nbsp;(versiones)  y sus cambios (control de versiones <a href="https://es.wikipedia.org/wiki/Control_de_versiones" title="Control de versiones"></a>).</li>
    <li>La  conducci&oacute;n de la integraci&oacute;n de las partes del software en un solo producto de  software.</li>
  </ul>
</div>
<p align="justify"><u>Elemento  de configuraci&oacute;n de software (ECS)</u><br />
  Es la informaci&oacute;n creada como parte del proceso de  ingenier&iacute;a de software. Componente simple que es una unidad en s&iacute; mismo, que  puede definirse y controlarse de forma separada, ha logrado un estado estable  en el proceso de desarrollo y por tanto se inserta dentro del control de  configuraci&oacute;n. Es la unidad m&iacute;nima de trabajo de la GCS, como:</p>
<div align="justify">
  <ul>
    <li>Est&aacute;ndares  de an&aacute;lisis, dise&ntilde;o, codificaci&oacute;n, pruebas, y auditoria</li>
    <li>Ejecutables.  El C&oacute;digo fuente del programa</li>
    <li>Manual  de usuario</li>
    <li>Prototipos</li>
    <li>Documentos  (Visi&oacute;n, Especif. de CDU, etc.)</li>
  </ul>
</div>
<p align="justify">Para la realizaci&oacute;n de la SCM hay diferentes  herramientas. Pero herramientas que pretenden ofrecer una soluci&oacute;n total al  problema, a menudo no cumplen con los requisitos t&eacute;cnicos como:</p>
<div align="justify">
  <ul>
    <li>Apoyo  a diferentes plataformas.</li>
    <li>Iniciar  el proceso de&nbsp;build.</li>
    <li>Conexi&oacute;n  a los bancos de datos existentes.</li>
    <li>Integraci&oacute;n  a la organizaci&oacute;n existente.</li>
  </ul>
</div>
<p align="justify">Por esa raz&oacute;n ofrece una mayor flexibilidad una soluci&oacute;n  que integre herramientas parciales que sean m&aacute;s f&aacute;ciles de integrar en el  proceso existente, como:</p>
<div align="justify">
  <ul>
    <li>Uso  de un software de administraci&oacute;n de versiones como IBM Rational Team  Concert,CVS,Subversion,Sourcesafe,Clearcase,Darcs,Plastic SCM</li>
    <li>Introducci&oacute;n  de una herramienta para la documentacion &nbsp;comunitaria con una administracion de cambios <a href="https://es.wikipedia.org/wiki/Control_de_versiones" title="Control de versiones"></a>, acceso interactivo  y foro o alguna plataforma para la comunicaci&oacute;n.</li>
  </ul>
</div>
<p align="justify">Determinar un entorno para  el&nbsp;build&nbsp;autom&aacute;tico. </p>
<p align="justify"><a href="tema8.mp4" class="Estilo3">Video</a></p>
</body>
</html>
