<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {font-size: 24px}
-->
</style>
</head>

<body>
<p class="Estilo1">Configuracion de un sistema Operativo</p>
<p>La&nbsp;configuraci&oacute;n&nbsp;es un conjunto de  datos que determina el valor de algunas variables de un programa o de un&nbsp;sistema operativo.<br />
  De forma general, la instalaci&oacute;n se  compone de los siguientes pasos:</p>
<ul>
  <li>Configuraci&oacute;n del dispositivo de arranque en  la BIOS</li>
  <li>Creaci&oacute;n de las particiones en el disco duro</li>
  <li>Creaci&oacute;n del sistema de ficheros</li>
  <li>Selecci&oacute;n de paquetes&nbsp;</li>
  <li>Configuraci&oacute;n&nbsp;</li>
</ul>
<ul type="disc">
  <li><u>Instalaci&oacute;n y configuraci&oacute;n:</u><u> </u></li>
</ul>
<p>En el caso concreto de a pr&aacute;ctica, se va a  instalar un sistema operativo Microsoft Windows.  El instalador se subdivide en dos partes fundamentales:</p>
<ul>
  <li>Instalaci&oacute;n modo texto: Se encarga de  detectar y cargar los controladores necesarios. Permite crear las particiones y  sistema de ficheros y finaliza realizando la copia de los ficheros  imprescindibles.</li>
  <li>Instalaci&oacute;n gr&aacute;fica: encargada de realizar la  copia de los ficheros del sistema y aplicaciones del sistema operativo y  permite configurar las opciones de internacionalizaci&oacute;n y de red.</li>
</ul>
<p><strong>Es importante que realices ajustes el sistema  operativo para hacerlo m&aacute;s seguro como:</strong><strong> </strong></p>
<ul type="disc">
  <li>Deshabilita las carpetas compartidas si no las       utilizas. Esto evita la propagaci&oacute;n de programas maliciosos que las       aprovechen para infectar el ordenador.</li>
  <li>Utiliza contrase&ntilde;as seguras y f&aacute;ciles de       recordar tanto en aplicaciones como a nivel de acceso al ordenador para       evitar que puedan acceder personas no deseadas.</li>
  <li>Crea perfiles de usuario con privilegios       restringidos, de manera que se limiten las acciones de algunos usuarios       que puedan provocar un aumento de posibilidades de infecci&oacute;n.</li>
  <li>Deshabilita la ejecuci&oacute;n autom&aacute;tica de       dispositivos de almacenamiento extra&iacute;bles (como USB), ya que pueden       contener aplicaciones maliciosas que se ejecuten en segundo plano,       invisibles al usuario.</li>
  <li>Ten en cuenta que el soporte t&eacute;cnico en       versiones antiguas de sistemas operativos y aplicaciones recibe menos       atenci&oacute;n que en el de las &uacute;ltimas versiones, por lo que por norma general       las versiones m&aacute;s antiguas est&aacute;n m&aacute;s expuestas a vulnerabilidades.</li>
  <li>Normalmente los archivos maliciosos se       esconden en el sistema como ficheros ocultos, por lo que muchas veces se       encuentran configurando el sistema para que se permitan ver los archivos       ocultos.</li>
  <li>Es posible configurar la visualizaci&oacute;n de las       extensiones de archivos para que puedas identificar las extensiones de       archivos que se hayan descargado y evitar ser v&iacute;ctima de t&eacute;cnicas como la       doble extensi&oacute;n.</li>
</ul>
<p><align="center"><img border="0" width="306" height="315" src="clip_image002.jpg" alt="pic012.jpg"/> </p>
<br clear="all" />
<p>&nbsp;</p>
<p><u>PRACTICA: Configuraci&oacute;n de un sistema  operativo</u><br />
  Para  la pr&aacute;ctica se realizaron los siguientes pasos:</p>
<ul>
  <li>Instalaci&oacute;n del Sistema Operativo (v&iacute;deo  explicativo)</li>
  <li>Personalizar el explorador de ficheros. Para  abrir el explorador de archivos se puede o bien hacer doble click sobre el  icono mi PC o bien mediante la combinaci&oacute;n de teclas: &ldquo;tecla de Windows + E&rdquo;. Una vez abierto, seleccionar la opci&oacute;n de  men&uacute;: Herramientas &rarr; Opciones de carpeta:</li>
  <li>Desactivar &laquo;Ocultar extensiones de archivos  conocidos&raquo;. En la pesta&ntilde;a Ver, dentro de la parte Configuraci&oacute;n avanzada.</li>
  <li>Desactivar &laquo;Recordar configuraci&oacute;n de vistas  de carpetas&raquo;. En la pesta&ntilde;a Ver, dentro de la parte Configuraci&oacute;n avanzada.</li>
  <li>Instalar Style XP (est&aacute; en la unidad  compartida C:\) y personalizar el escritorio)</li>
  <li>Probar como configurar la barra de  exploraci&oacute;n, estilos visuales, el fondo de pantalla, transparencias, etc.</li>
  <li>Comprobar la correcta configuraci&oacute;n de la red</li>
  <li>Realizar una consulta para resolver la  direcci&oacute;n www.fi.up.es. Para ello, abriremos una ventana de s&iacute;mbolo  de sistema, bien mediante la opci&oacute;n del men&uacute; Inicio, Ejecutar &rarr; cmd, o bien en  el men&uacute; Inicio, Programas &rarr; Accesorios &rarr; S&iacute;mbolo de sistema. </li>
  <li>Realizar un ping a&nbsp;www.fi.up.es&nbsp;para comprobar la conectividad. En la  misma ventana de s&iacute;mbolo de sistema, teclear la orden ping&nbsp;www.fi.up.es. De este modo, podremos ver si el servidor  web de la facultad est&aacute; activo o incluso si nuestro ordenador tiene  conectividad con el exterior.</li>
  <li>Navegador</li>
  <li>Descargar e instalar el navegador Maxthon  de http://www.maxthon.com. </li>
  <li>Descargar la traducci&oacute;n al espa&ntilde;ol de la  misma p&aacute;gina (secci&oacute;n&nbsp;downloads).&nbsp;</li>
  <li>Configurar el navegador. Se aconseja probar  las siguientes opciones, utilizando el asistente de configuraci&oacute;n (Open Configuration  Wizard).</li>
  <li>Habilitar S&uacute;per Arrastrar y Soltar</li>
  <li>Habilitar Control con rat&oacute;n</li>
  <li>Bloqueo completo de elementos emergentes y  publicidad de las p&aacute;ginas.</li>
  <li>Abrir el centro de configuraci&oacute;n de Maxthon  (Open Maxthon Setup Center). En esta ventana podemos configurar m&uacute;ltiples  opciones del navegador.</li>
  <li>Visitar alguna p&aacute;gina con publicidad, por  ejemplo www.terra.es o www.elpais.es&nbsp;y veremos como esta se suprime autom&aacute;ticamente.</li>
  <li>Probar las &laquo;acciones de rat&oacute;n&raquo;</li>
  <li>A&ntilde;adir un par de fuentes a la sindicaci&oacute;n de  contenidos disponible en el navegador Maxthon, en la parte izquierda de la  pantalla, bajo el nombre Mis suscripciones.</li>
  <li>B&uacute;squedas web: realizar las b&uacute;squedas y  comentar las diferencias entre ellas</li>
  <li>Sintaxis b&aacute;sica: buscar &laquo;iglesias en julio&raquo; y  &laquo;&ldquo;iglesias en julio&rdquo;&raquo;</li>
  <li>Opciones avanzadas web mediante google.</li>
  <li>Excluyendo palabras clave: excluir &laquo;&ldquo;julio  iglesias&rdquo;&raquo; de cada una de las b&uacute;squedas anteriores</li>
  <li>Dentro de un sitio: Realizar las dos  b&uacute;squedas s&oacute;lo para&nbsp;fi.upm.es</li>
  <li>P&aacute;ginas que enlazan a una dada: Repetir las  b&uacute;squedas en las p&aacute;ginas que enlacen a una cualquiera de las obtenidas en las  b&uacute;squedas anteriores</li>
  <li>P&aacute;ginas relacionadas con una: Buscar p&aacute;ginas  relacionadas con una de las p&aacute;ginas de cualquier b&uacute;squeda anterior.</li>
  <li>Correo electr&oacute;nico utilizando Microsoft  Outlook (hay que solicitar la informaci&oacute;n en la sala de operadores con  identificaci&oacute;n)</li>
  <li>Configurar una cuenta&nbsp;IMAP</li>
  <li>Es posible la configuraci&oacute;n de una cuenta POP30 (Hay que tener en cuenta que el correo existente se  descargar&aacute; al disco duro local borr&aacute;ndose del servidor)</li>
  <li>Configurar una  cuenta&nbsp;HTML&nbsp;(Necesaria una cuenta de Hotmail)</li>
  <li>Crear vuestra tarjeta de visita y a&ntilde;adidla  como firma a un mensaje (men&uacute; Herramientas &rarr; Opciones, en la pesta&ntilde;a Formato de  correo)</li>
  <li>Utilidades necesarias</li>
  <li>Buscar, instalar y probar al menos 7  utilidades (el asterisco indica las que posiblemente sean m&aacute;s &uacute;tiles)</li>
</ul>
<p><a href="tema 6.mp4">Video</a><br clear="all" />
</p>
<p class="Estilo1">&nbsp;</p>
</body>
</html>
