<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {
	color: #000000;
	font-size: 24px;
}
.Estilo2 {font-size: 16px}
-->
</style>
</head>

<body>
<p class="Estilo1">Instalacion de un Sistema Operativo en una maquina virtual</p>
<p>Cuentas con herramientas como&nbsp;<a href="http://www.virtualbox.org/">Virtual  Box</a>, un gestor de  m&aacute;quinas virtuales. Su funci&oacute;n es simular todos los elementos de un PC b&aacute;sico,  incluyendo CPU, memoria, tarjeta de v&iacute;deo y de sonido, Internet y disco duro,  entre otros.<br />
  Las ventajas que puedes trastear con la m&aacute;quina virtual e  instalar cualquier software sin miedo porque a nuestro ordenador no le pasar&aacute;  nada.<br />
  A continuaci&oacute;n te explicamos todos los pasos a seguir  para instalar Linux en Virtual Box sin afectar a tu sistema operativo actual y  consiguiendo la mejor integraci&oacute;n posible entre los dos sistemas, el real y el  virtual:<br />
  <strong>Paso 1 - Descargar  el instalador de Virtual Box</strong><br />
  Asumiendo que vas a probar Linux por primera vez,  necesitas instalar Virtual Box en tu ordenador, usando la versi&oacute;n &nbsp;<a href="http://virtualbox.softonic.com/mac/descargar">Mac OS X</a>&nbsp;o para&nbsp;<a href="http://virtualbox.softonic.com/descargar">Windows</a>.</p>
<p><strong>Paso 2 - Descargar una imagen ISO del  disco de instalaci&oacute;n de Ubuntu</strong><br />
  En este caso usaremos la&nbsp;<a href="http://ubuntu.softonic.com/linux/descargar">imagen  por defecto de Ubuntu</a>,  aunque puedes usar cualquier imagen, tanto de CD como de DVD, ya sea de  OpenSUSE, Fedora, Debian, Mandriva u otras.</p>
<p><strong>Paso 3 - Crear una nueva m&aacute;quina virtual</strong><br />
  En primer lugar necesitas crear una m&aacute;quina virtual. Virtual  Box permite crearla para un sistema operativo concreto. S&oacute;lo hay que escribir  un nombre, por ejemplo Ubuntu Softonic, escoger Linux como sistema operativo y  Ubuntu como versi&oacute;n.<br />
  Especial atenci&oacute;n hay que dedicarle a la&nbsp;memoria  RAM. De ello depende que tu m&aacute;quina virtual funcione mejor o peor y que el ordenador  lo aguante: no hay que olvidar que haremos funcionar al mismo tiempo dos  sistemas operativos en un solo equipo. Lo ideal es dedicar&nbsp;la mitad de la  RAM, es decir, 512 MB si tu PC dispone de 1GB.<br />
  Y en cuanto al disco duro, depende tambi&eacute;n de cu&aacute;nto espacio  tienes libre y cu&aacute;nto espacio est&aacute;s dispuesto a sacrificar para Linux.&nbsp;Lo  ideal es de 8 a 10 GB como m&iacute;nimo. As&iacute; podr&aacute;s instalar juegos y programas sin  problemas. Marcando la opci&oacute;n de&nbsp;disco din&aacute;mico, ir&aacute;s ocupando esos  gigabytes poco a poco en lugar de hacerlo de golpe con la opci&oacute;n de tama&ntilde;o  fijo.</p>
<p><strong>Paso 4 - Configurar  la m&aacute;quina virtual</strong> </p>
<p>Ahora ya tienes una m&aacute;quina virtual para trastear con ella  cuanto quieras. Pero antes de instalar Ubuntu en ella, ser&aacute; mejor que eches un  vistazo a las opciones de configuraci&oacute;n.</p>
<p class="Estilo1"><a href="tema 6.mp4" class="Estilo2">Video</a> </p>
</body>
</html>
