<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo3 {font-size: x-large}
.Estilo4 {color: #000000}
.Estilo5 {font-size: 36px; }
-->
</style>
</head>

<body>
<p class="Estilo5">Analizar los diferentes sistemas operativos y instalacion segun los requerimientos</p>
<table border="1" cellspacing="0" cellpadding="0" align="left">
  <tr>
    <td width="199"><p align="center"><strong>UBUNTU</strong></p></td>
    <td width="392" valign="top"><p>Basado en una versi&oacute;n del sistema operativo Linux    .su principal beneficio es que es gratuito y de c&oacute;digo abierto .Tiene    actualizaciones cada seis meses. No tiene calendario de actualizaci&oacute;n .la    mayor&iacute;a de los software compatible con Ubuntu tambi&eacute;n son gratuitos y    disponibles en &ldquo;repositorio&rdquo; en l&iacute;nea. </p></td>
  </tr>
  <tr>
    <td width="199"><p align="center"><strong>ANDROID</strong></p></td>
    <td width="392" valign="top"><p>Android es un sistema &ldquo;m&oacute;vil&rdquo; las compa&ntilde;&iacute;as y    organizaciones que contribuyen al desarrollo del sistema baja la direcci&oacute;n de    GOOGLE inc. El sistema es una norma abierta que significa que una completa    comunidad de desarrolladores pueden modificar el software. A la fecha de esta    publicaci&oacute;n , las cuatro compa&ntilde;&iacute;as m&aacute;s importantes , VERIZON , T-MOBILE,SPRINT    y AT&amp;A.</p></td>
  </tr>
  <tr>
    <td width="199"><p align="center"><strong>Mac OS x</strong></p></td>
    <td width="392" valign="top"><p>Aunque una versi&oacute;n de Mac OS X viene preinstalada    en todas las computadoras APPLE Macintosh ,los usuarios deben pagar si desean    usar nuevas versiones .El sistema no es c&oacute;digo abierto por lo que solo se    desarrollan de APPLE tiene la capacidad de realizar modificaciones o mejoras    de forma .legitimas a su c&oacute;digo ,</p></td>
  </tr>
  <tr>
    <td width="199"><p align="center"><strong>WINDOWS</strong></p></td>
    <td width="392" valign="top"><p>E sun sistema operativo desarrollado y operado    por Microsoft .Se diferencia de los sistemas de c&oacute;digo abierto en que solo    Microsoft tiene la capacidad para modificar el c&oacute;digo .sin embargo, tambi&eacute;n    se diferencia de Mac OS X en que puede ser instalado en diversas computadoras    diferente de una serie de fabricantes que compiten. Windows es el sistema    operativo m&aacute;s utilizado por versiones nuevas y mejores.</p></td>
  </tr>
  <tr>
    <td width="199"><p align="center"><strong>iOS</strong></p></td>
    <td width="392" valign="top"><p>Es el sistema operativo m&oacute;vil de APPLE este    sistema ejecuta sobre dispositivos &iexcl;pod, Iphone y ipad de la compa&ntilde;&iacute;a. Al    igual que Mac OSX, solo pueden ser usados en dispositivos m&oacute;viles .Una    ventaja de iOS es que para este sistema existen m&aacute;s aplicaciones.</p></td>
  </tr>
  <tr>
    <td width="199"><p align="center"><strong>MS-DOS</strong><strong> </strong></p></td>
    <td width="392" valign="top"><p>Es un sistema    operativo monousuario y monotarea.<br />
      Est&aacute; dedicado a la    ejecuci&oacute;n de un proceso, por lo    que la planificacion &nbsp;del    procesador es simple y se dedica al &uacute;nico proceso activo que pueda existir en    un momento dado.<br />
      Sirve para    identificar los ficheros propios del sistema, usados para cargar el sistema    operativo. Se puede activar en cualquier fichero y este se comportar&aacute; como un    fichero oculto, pero no se pueden ejecutar. </p></td>
  </tr>
</table>
<br clear="all" />
<p>&nbsp;</p>
<p>La&nbsp;instalaci&oacute;n&nbsp;de los programas computacionales &nbsp;(software)  es el proceso fundamental por el cual los nuevos programas son transferidos a  un computador con el fin de ser configurados, y preparados para ser desarrollados.<br />
    <u>Sus procesos para la  instalaci&oacute;n son:</u></p>
<ul>
  <li>Verificaci&oacute;n  de la compatibilidad: Se debe comprobar si se cumplen los requisitos para la  instalaci&oacute;n en cuanto a hardware y software. A veces es necesario desinstalar versiones antiguas del  mismo software.</li>
  <li class="Estilo4">Verificaci&oacute;n  de la integridad: Se verifica que el paquete del software &nbsp;es el original, esto se hace para  evitar la instalaci&oacute;n de programas maliciosos.</li>
  <li class="Estilo4">Creaci&oacute;n  de los directorios requeridos: Para mantener el orden en el directorio cada  sistema operativo puede tener un est&aacute;ndar para la instalaci&oacute;n de ciertos  archivos en ciertos directorios. </li>
  <li class="Estilo4">Creaci&oacute;n  de los usuarios requeridos: Para deslindar responsabilidades y tareas se pueden  o deben usar diferentes usuarios para diferentes paquetes de software.</li>
  <li class="Estilo4">Concesi&oacute;n  de los derechos requeridos: Para ordenar el sistema y limitar da&ntilde;os en caso  necesario, se le conceden a los usuarios solo el m&iacute;nimo necesario de derechos.</li>
  <li class="Estilo4">Copia, desempaque &nbsp;y decomplecion &nbsp;de los archivos desde el paquete de software</li>
  <li class="Estilo4">Archivos  principales, sean de fuente o binarios.</li>
  <li class="Estilo4">Archivos  de datos, por ejemplo datos, im&aacute;genes, modelos, documentos XML-Dokumente, etc.</li>
  <li class="Estilo4">Documentacion</li>
  <li class="Estilo4">Archivos  de configuraci&oacute;n</li>
  <li class="Estilo4">Bibliotecas</li>
  <li class="Estilo4">Elances duros <span class="Estilo4">&nbsp;o enlaces simbologico &nbsp;a otros archivo</span>s</li>
</ul>
<ul>
  <li>Compilaci&oacute;n  y enlace con la biblioteca requerida: En algunos casos no se puede evitar el  complicado paso de la compilaci&oacute;n y enlace que a su vez tiene severos  requerimientos de software al sistema. El enlace con bibliotecas requeridas  puede ser un problema si en su instalaci&oacute;n no se acataron los est&aacute;ndares  establecidos.</li>
  <li>Configuraci&oacute;n:  Por medio de archivos de configuraci&oacute;n se le da a conocer al software con que  par&aacute;metros debe trabajar. Por ejemplo, los nombres de las personas que pueden  usar el software, como verificar su clave de ingreso, la ruta donde se encuentran los archivos con  datos o la direcci&oacute;n de nuestro proveedor de correo Eletronico.  Para sistemas complejos se debe desarrollar el Software Configuration Managemet.</li>
  <li>Definir  las variable de entorno requeridas: Algunos comportamientos del  software solo pueden ser determinados por medio de estas variables. Esto es  parte de la configuraci&oacute;n, aunque es m&aacute;s din&aacute;mica.</li>
  <li>Registro  ante el due&ntilde;o de la marca: Para el Software comerciales a veces el desarrollador de software  exige el registro de la instalaci&oacute;n si se desea su servicio.</li>
</ul>
<p><u>Los t&eacute;rminos de la instalaci&oacute;n son:</u></p>
<ul>
  <li>Si  un sistema de gestion de paquetes&nbsp;realiza  paquetes de software del sistema.</li>
  <li>En  caso de que biblioteca&nbsp;hayan sido cambiadas por la  instalaci&oacute;n, es necesario arrancar&nbsp;el sistema operativo o el software  nuevamente para hacer efectivos los cambios en todos los programas.</li>
</ul>
<br clear="all" />
<p>&nbsp;</p>
<p>La mayor&iacute;a de los  usuarios emplean el sistema operativo que viene de serie con e ordenador,  aunque se puede sustituir o cambiar, en el caso de que quieras otro. <br />
  &nbsp;La interfaz  gr&aacute;fica de usuario es la que permite que todo se muestre de forma clara en la  pantalla y que puedas interactuar con los diferentes men&uacute;s e iconos con un  simple click.<br />
  En probabilidad noy ayudara a  saber cuentos tipos de sistemas operativos tienen y su configuracion de  arranque en la grafica siguente me ayudara a saber los sistemas operativos mas  usados y su configuracion de arranque mas conocida.<br />
  <img src="file:///C|/Users/Jordi/AppData/Roaming/Macromedia/Dreamweaver 8/OfficeImageTemp/clip_image002.png" alt="Analizar" width="577" height="337" border="0" /> <br />
  En esta grafica vemos que windows  es el que ha tenido cambios en versionas como por ejemplo versiones de 3.1 en  adelante recordemos que cada sistema operativos tiene diferentes funciones y  procedimientos para llevarse a cabo en una computtadora. El sistema mas  reconocido es el Windows que tienen que ser analizadas cada una de sus  funciones para obtener resultados al momento de trabajar con ella.</p>
<p>&nbsp;</p>
<p class="Estilo3">&nbsp;</p>
</body>
</html>
