<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {font-size: 36px}
.Estilo2 {font-size: 16px}
-->
</style>
</head>

<body>
<p class="Estilo1">Instalacion de una maquinan virtual</p>
<p>VirtualBox es un programa que emula una  segunda computadora, lo que te permitir&aacute; instalar y utilizar sistemas  operativos (p.ej., Windows 7) sin la necesidad de cambiar el que tiene tu  computadora actualmente.</p>
<ul>
  <li><a name="step_1_1" id="step_1_1"></a>Abre  el sitio web de VirtualBox.&nbsp;Desde el navegador de tu computadora, dir&iacute;gete  a la siguiente direcci&oacute;n:&nbsp;<a href="https://www.virtualbox.org/">https://www.virtualbox.org/</a>.  Este es el sitio web desde el cual descargar&aacute;s el archivo de instalaci&oacute;n de  VirtualBox.</li>
  <li>Haz  clic en&nbsp;&ldquo;descargar VirtualBox&rdquo;.&nbsp;Este es un bot&oacute;n de color azul  ubicado en el medio de la p&aacute;gina. Al hacer clic en &eacute;l, se abrir&aacute; la p&aacute;gina de  descargas.</li>
  <li>Haz clic en&nbsp;&ldquo;Windows hosts&rdquo;.&nbsp;Este  enlace se encuentra debajo del encabezado &quot;VirtualBox 5.2.8 platform packages&quot;  (paquetes de la plataforma VirtualBox 5.2.8). A continuaci&oacute;n, se iniciar&aacute; la  descarga del archivo VirtualBox EXE.</li>
  <li>Abre  el archivo VirtualBox EXE.&nbsp;Dir&iacute;gete a la ubicaci&oacute;n en la que se descarg&oacute;  el archivo EXE y haz doble clic en &eacute;l. A continuaci&oacute;n, se abrir&aacute; la ventana de  instalaci&oacute;n de VirtualBox.</li>
  <li>Navega  a trav&eacute;s de las instrucciones de instalaci&oacute;n.&nbsp;Sigue los pasos a  continuaci&oacute;n:</li>
  <li>Haz clic en&nbsp;&ldquo;Siguiente&rdquo;&nbsp;en  las primeras tres p&aacute;ginas.</li>
  <li>Haz clic en&nbsp;&ldquo;S&iacute;&rdquo;&nbsp;cuando  se te indique.</li>
  <li>Haz clic en&nbsp;&ldquo;Instalar&rdquo;.</li>
  <li>Haz clic en&nbsp;&ldquo;S&iacute;&rdquo;&nbsp;cuando  se te indique.</li>
</ul>
<ul>
  <li>Haz  clic en&nbsp;Instalar&nbsp;cuando se te indique.&nbsp;De esta manera,  VirtualBox comenzar&aacute; a instalarse en tu computadora.</li>
  <li>Haz  clic en&nbsp;Finalizar&nbsp;cuando se te indique.&nbsp;Este bot&oacute;n se encuentra  en la parte inferior derecha de la ventana. Al hacerlo, se cerrar&aacute; la ventana  de instalaci&oacute;n y se abrir&aacute; VirtualBox. Ahora que has instalado y abierto esta  aplicaci&oacute;n, podr&aacute;s crear una maquina virtual para as&iacute; ejecutar  cualquier sistema operativo en tu computadora.</li>
  <li>Antes de hacerlo, aseg&uacute;rate  de no desmarcar la casilla &ldquo;Inicio&rdquo;.</li>
</ul>
<br clear="all" />
<p>&nbsp;</p>
<p><u>PRACTICA:</u><br />
  Instalaci&oacute;n una m&aacute;quina virtual</p>
<ul>
  <li>A continuaci&oacute;n  tienes que arrancar VirtualBox</li>
</ul>
<p align="center"><img border="0" width="266" height="200" src="clip_image002_0000.png" alt="201virtual-ova-en-virtualbox-01.png" /> </p>
<ul>
  <li>Posteriormente  tienes que acceder a la importaci&oacute;n del servicio virtualizado.</li>
</ul>
<p align="center"><img border="0" width="257" height="194" src="file:///C|/Users/Jordi/AppData/Roaming/Macromedia/Dreamweaver 8/OfficeImageTemp/clip_image004.png" alt="http://descargarmaquinasvirtuales.com/wp-content/uploads/2017/10/importar-maquina-virtual-ova-en-virtualbox-02.png" /> </p>
<ul>
  <li>Luego tienes que seleccionar:</li>
  <li>El archivo OVA,</li>
  <li>El destino del  disco duro (Virtual)</li>
  <li>Seleccionar  Reinicializar la direcci&oacute;n MAC de todas las tarjetas de red para evitar  conflictos.</li>
  <li>Hacer clic en  &laquo;Importar.</li>
</ul>
<p align="center"><img border="0" width="257" height="220" src="file:///C|/Users/Jordi/AppData/Roaming/Macromedia/Dreamweaver 8/OfficeImageTemp/clip_image006.png" alt="http://descargarmaquinasvirtuales.com/wp-content/uploads/2017/10/importar-maquina-virtual-ova-en-virtualbox-03.png" /> </p>
<ul>
  <li>Se inicia la importaci&oacute;n.</li>
</ul>
<p align="center"><img border="0" width="257" height="194" src="file:///C|/Users/Jordi/AppData/Roaming/Macromedia/Dreamweaver 8/OfficeImageTemp/clip_image008.jpg" alt="http://descargarmaquinasvirtuales.com/wp-content/uploads/2017/10/importar-maquina-virtual-ova-en-virtualbox-04.png" /> </p>
<ul>
  <li>Tras finalizar la importaci&oacute;n, para arrancar la m&aacute;quina tienes que  seleccionarla y hacer clic en el bot&oacute;n Iniciar.</li>
</ul>
<p align="center"><img border="0" width="257" height="194" src="file:///C|/Users/Jordi/AppData/Roaming/Macromedia/Dreamweaver 8/OfficeImageTemp/clip_image010.jpg" alt="http://descargarmaquinasvirtuales.com/wp-content/uploads/2017/10/importar-maquina-virtual-ova-en-virtualbox-05.png" /> </p>
<ul>
<ul>
  <li>Y en poco tiempo tienes arrancada la m&aacute;quina virtual.</li>
</ul>
<p class="Estilo1"><a href="tema 5.mp4" class="Estilo2">Video</a></p>
<p class="Estilo1">&nbsp;</p>
</body>
</html>
